In [1]:
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series(np.arange(4), index=['a','b','c','d'])
obj

a    0
b    1
c    2
d    3
dtype: int32

In [5]:
obj['b']
obj[1]

1

In [11]:
obj[3]
obj[2:4]

c    2
d    3
dtype: int32

In [12]:
obj[['b','a','d']]

b    1
a    0
d    3
dtype: int32

In [13]:
obj[obj<2]

a    0
b    1
dtype: int32

In [14]:
obj[1:2] #2는 포함 안됨

b    1
dtype: int32

In [15]:
obj['b':'c'] # c는 포함됨

b    1
c    2
dtype: int32

In [17]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
             index=["Seoul","Incheon","Suwon","Daejeon"],
             columns=['one','two','three','four'])
data

         one  two  three  four
Seoul      0    1      2     3
Incheon    4    5      6     7
Suwon      8    9     10    11
Daejeon   12   13     14    15

In [18]:
data['two']

Seoul       1
Incheon     5
Suwon       9
Daejeon    13
Name: two, dtype: int32

In [19]:
data[['two','one']]

         two  one
Seoul      1    0
Incheon    5    4
Suwon      9    8
Daejeon   13   12

In [20]:
data[:2]

         one  two  three  four
Seoul      0    1      2     3
Incheon    4    5      6     7

In [21]:
data[data['three'] > 5] # three열 값이 5보다 큰 모든 데이터 추출

         one  two  three  four
Incheon    4    5      6     7
Suwon      8    9     10    11
Daejeon   12   13     14    15

In [23]:
data < 5 # 전체 data 바탕으로 값이 나옴

           one    two  three   four
Seoul     True   True   True   True
Incheon   True  False  False  False
Suwon    False  False  False  False
Daejeon  False  False  False  False

In [24]:
data[data<5] # 조건 만족하지 않은것은 nan

         one  two  three  four
Seoul    0.0  1.0    2.0   3.0
Incheon  4.0  NaN    NaN   NaN
Suwon    NaN  NaN    NaN   NaN
Daejeon  NaN  NaN    NaN   NaN

In [25]:
data[data<5] = 0
data

         one  two  three  four
Seoul      0    0      0     0
Incheon    0    5      6     7
Suwon      8    9     10    11
Daejeon   12   13     14    15

In [26]:
data.iloc[1,1:3]

two      5
three    6
Name: Incheon, dtype: int32

In [28]:
data.loc['Incheon',['two','three']]

two      5
three    6
Name: Incheon, dtype: int32

In [29]:
data.iloc[2,1]

9

In [30]:
data.iloc[2,[1,2,0]]

two       9
three    10
one       8
Name: Suwon, dtype: int32

In [31]:
data.iloc[2,1] # ilocsms 정수 색인(묵시적 경우 인덱스)

9

In [32]:
data.iloc[[1,3],[3,1,2]]

         four  two  three
Incheon     7    5      6
Daejeon    15   13     14

In [33]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
             index=["Seoul","Incheon","Suwon","Daejeon"],
             columns=['one','two','three','four'])
data

         one  two  three  four
Seoul      0    1      2     3
Incheon    4    5      6     7
Suwon      8    9     10    11
Daejeon   12   13     14    15

In [34]:
data.loc[:'Suwon','two']

Seoul      1
Incheon    5
Suwon      9
Name: two, dtype: int32

In [36]:
data.iloc[:,:3]

         one  two  three
Seoul      0    1      2
Incheon    4    5      6
Suwon      8    9     10
Daejeon   12   13     14

In [37]:
data.iloc[:,:3][data.three>5] # data.iloc[:,:3] 에대해  [data.three>5] 조건 반영

         one  two  three
Incheon    4    5      6
Suwon      8    9     10
Daejeon   12   13     14

In [39]:
ser = pd.Series(np.arange(3),index=['a','b','c'])
ser

a    0
b    1
c    2
dtype: int32

In [49]:
ser[-1]

2

In [51]:
ser[:1] # 1은 포함하지 않지만
ser[:'b'] # b는 포함한다

a    0
b    1
dtype: int32

In [52]:
# pandas 산술 연산
s1 = pd.Series([7,-2,3,1], index=['a','c','d','e'])
s2 = pd.Series([2,-3,4,2,5], index=['a','c','e','f','g'])

In [56]:
s1+s2

a    9.0
c   -5.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

In [57]:
list('bcd') # 문자열을 list에 넣으면 list 요소로써 들어간다

['b', 'c', 'd']

In [58]:
df1 = pd.DataFrame(np.arange(9).reshape(3,3),
                  columns=['b','c','d'],
                  index=['Seoul','Busan','Gwangju'])

df2 =pd.DataFrame(np.arange(12).reshape(4,3),
                 columns=list("bde"),
                 index=['Daegu','Seoul','Busan','Jeju'])

In [59]:
df1

         b  c  d
Seoul    0  1  2
Busan    3  4  5
Gwangju  6  7  8

In [60]:
df2

       b   d   e
Daegu  0   1   2
Seoul  3   4   5
Busan  6   7   8
Jeju   9  10  11

In [61]:
df1 + df2

           b   c     d   e
Busan    9.0 NaN  12.0 NaN
Daegu    NaN NaN   NaN NaN
Gwangju  NaN NaN   NaN NaN
Jeju     NaN NaN   NaN NaN
Seoul    3.0 NaN   6.0 NaN

In [62]:
df1 = pd.DataFrame({'A':[1,2]})
df1
df2 = pd.DataFrame({'A':[3,4]})
df2

   A
0  3
1  4

In [63]:
df1-df2

   A
0 -2
1 -2

In [64]:
df1 = pd.DataFrame(np.arange(12).reshape(3,4),
                  columns=['a','b','c','d'])

df2 =pd.DataFrame(np.arange(20).reshape(4,5),
                 columns=list("abcde"))

In [65]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [66]:
# 6출력
df2.loc[1]['b'] # label 1인 것
df2.loc[1,'b']

6

In [67]:
df2.iloc[1,1]

6

In [68]:
df2.iloc[-3]

a    5
b    6
c    7
d    8
e    9
Name: 1, dtype: int32

In [69]:
df2.iloc[-3,1] = np.nan

In [70]:
df2

    a     b   c   d   e
0   0   1.0   2   3   4
1   5   NaN   7   8   9
2  10  11.0  12  13  14
3  15  16.0  17  18  19

In [71]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [72]:
df1.add(df2)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [73]:
df1.add(df2,fill_value=0) # Nan 0으로 채워라

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [75]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [76]:
df2

    a     b   c   d   e
0   0   1.0   2   3   4
1   5   NaN   7   8   9
2  10  11.0  12  13  14
3  15  16.0  17  18  19

In [ ]:
# df1과 df2 가 동일한 인덱스를 갖길 원할 때
# reindex !!

In [77]:
df1.reindex(index=df2.index)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0
3  NaN  NaN   NaN   NaN

In [78]:
df = pd.DataFrame(np.random.randn(4,3),
                 columns=list('bde'),
                 index=['Seoul','Busan','Daegu','Incheon'])
df

                b         d         e
Seoul    0.683812  0.019219 -0.235064
Busan   -2.143661 -0.454845  1.068237
Daegu   -1.646943 -2.030259  0.873498
Incheon  0.589651 -1.024372  1.375780

In [80]:
# 각 열에 대해 최대값-최소값을 뺀 결과를 추출
df['b']
type(df.b)

pandas.core.series.Series

In [81]:
df['b'].max() - df['b'].min()

2.82747317512151

In [ ]:
#apply함수
# 각 컬럼에 해당되는 1차원 배열에 대해 함수를 적용

In [82]:
f = lambda x: x.max()-x.min()
df.apply(f)
# df의 변수에 저장되어 있는 데이터 프레임에 대해 각각의 열을 f 함수에 전달

b    2.827473
d    2.049477
e    1.610844
dtype: float64

In [83]:
df.apply(f,axis = 0) # default

b    2.827473
d    2.049477
e    1.610844
dtype: float64

In [86]:
df.apply(f,axis='index') # axis = 'index' 같은 표현

b    2.827473
d    2.049477
e    1.610844
dtype: float64

In [85]:
df.apply(f,axis=1)

Seoul      0.918877
Busan      3.211898
Daegu      2.903756
Incheon    2.400152
dtype: float64

In [87]:
df
# df에 저장되어 있는 데이터에 대해 도시 단위로 평균값을 구하기

                b         d         e
Seoul    0.683812  0.019219 -0.235064
Busan   -2.143661 -0.454845  1.068237
Daegu   -1.646943 -2.030259  0.873498
Incheon  0.589651 -1.024372  1.375780

In [88]:
import numpy as np
df.apply(np.mean,axis=1)

Seoul      0.155989
Busan     -0.510089
Daegu     -0.934568
Incheon    0.313686
dtype: float64

In [89]:
f2 = lambda x:x.mean()
df.apply(f2, axis= 1)

Seoul      0.155989
Busan     -0.510089
Daegu     -0.934568
Incheon    0.313686
dtype: float64

In [91]:
df.mean(axis=0)
df.mean(axis=1)

Seoul      0.155989
Busan     -0.510089
Daegu     -0.934568
Incheon    0.313686
dtype: float64

In [92]:
df.max(axis=1)-df.min(axis=1)

Seoul      0.918877
Busan      3.211898
Daegu      2.903756
Incheon    2.400152
dtype: float64

In [93]:
# df에 있는 모든 수치데이터에 대해 소수점 이하 2자리 까지만 출력
#df.apply(round(2))

myformat = lambda x: '%.2f' % x
myformat(3.1415123)

'3.14'

In [94]:
df.applymap(myformat) # 열 벡터를 구성하는 요소 '각각'에 대해 함수 적용 (applymap)

             b      d      e
Seoul     0.68   0.02  -0.24
Busan    -2.14  -0.45   1.07
Daegu    -1.65  -2.03   0.87
Incheon   0.59  -1.02   1.38

In [95]:
df.applymap(round)

         b  d  e
Seoul    1  0  0
Busan   -2  0  1
Daegu   -2 -2  1
Incheon  1 -1  1

In [ ]:
# 데이터 단위로 함수를 일괄적으로 적용
# 행/열 단위로 함수를 일괄적으로 적용
# apply함수 : 데이터프레임의 행,열 단위로 함수를 일괄 적용
# applymap함수 : 데이터프레임의 요소(데이터) 단위로 함수를 일괄 적용
# map함수 : 시리즈의 모든 요소(데이터) 단위로 함수를 일괄 적용

In [96]:
df['e']

Seoul     -0.235064
Busan      1.068237
Daegu      0.873498
Incheon    1.375780
Name: e, dtype: float64

In [99]:
df['e'].map(format)

Seoul      -0.23506424400647064
Busan        1.0682374782026265
Daegu        0.8734976580186959
Incheon      1.3757796554904353
Name: e, dtype: object

In [100]:
srAge = pd.Series([10, 13, 15, 23, 22, 36])

In [101]:
srAge

0    10
1    13
2    15
3    23
4    22
5    36
dtype: int64

In [102]:
def myFunc(age):
    if age >= 10 and age < 20:
        res ='10대'
    elif age >= 20 and age <30:
        res ='20대'
    elif age >= 30 and age <40:
        res ='30대'
    else:
        res = np.nan
    return res    
        
print(srAge.map(myFunc))

0    10대
1    10대
2    10대
3    20대
4    20대
5    30대
dtype: object

In [103]:
# apply 함수
# 데이터프레임. 행/열(시리즈) 단위로 함수가 일괄 적용
# axis=0 (열), 1(행) 단위로 함수가 적용
df = pd.DataFrame([[1,3,5], [4,5,6], [7,8,10]])
df

   0  1   2
0  1  3   5
1  4  5   6
2  7  8  10

In [ ]:
# 행 단위로 최대값과 최소값의 차이를 구하는 함수
# 0 6
# 1 5 
# 3 5
# 열 단위로 최대값과 최소값의 차이를 구하는 함수
# 0 4
# 1 2
# 2 3

In [104]:
def maxmin(k):
    res = k.max()-k.min()
    return res

In [105]:
df.apply(maxmin,axis=0)

0    6
1    5
2    5
dtype: int64

In [106]:
df.apply(maxmin,axis=1)

0    4
1    2
2    3
dtype: int64

In [ ]:
"""
           0     1      2
     
최대값     7
최소값     1
차이       6

"""

In [107]:
def diff2(sr):
    return pd.Series([sr.max(),sr.min(),sr.max()-sr.min()], index=['최대값','최소값','차이'])
print(df.apply(diff2,axis=0))

     0  1   2
최대값  7  8  10
최소값  1  3   5
차이   6  5   5

In [109]:
df2 = pd.DataFrame([[1,1,1],[2,2,2],[3,3,3]])

In [110]:
df2

   0  1  2
0  1  1  1
1  2  2  2
2  3  3  3

In [111]:
def cal(k):
    return k*k

In [112]:
df2.applymap(cal)

   0  1  2
0  1  1  1
1  4  4  4
2  9  9  9